# ИТОГОВАЯ ПРОВЕРОЧНАЯ РАБОТА

### Задание: 
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначалальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Описание решения:

### 1. Ввод исходного массива.

Выбираем вариант с вводом заданного массива **newArray** с клавиатуры через запятую и пробел, для этого прописываем следующее:

```
Console.WriteLine("Введите элементы нового массива через запятую и пробел");

string[] newArray = Console.ReadLine().Split(", ");
Console.WriteLine();
```

### 2. Переменные.

**y** - целочисленная переменная, обозначает предельную длину элементов исходного массива, подлежащих включению в новый массив (newArrayShort). В данном случае принята равной 3;
**len** - целочисленная переменная, которой присваивается значение длины элемента заданного массива;
**x** - целочисленная переменная, которой будет присвено значение количества отвечающих условиям задачи элементов.


### 3. Определение используемых методов в программе. 
В нашем варианте решения методов будет 3:

#### 3.1 Определение длины нового массива.

Для определения длины нового массива нам потребуется метод с использованием  цикла **for**, параметрами которого будут первоначально заданный массив; длина данного массива; предельная величина элементов массива (в нашем случае - 3):

Код метода:
```
int NumberOfShort (string [] inarray, int inarraylen, int shortsize)
{
    int shortElements = 0;
    for (int i = 0; i < inarraylen; i++)
    {
        if (inarray[i].Length <= shortsize)
        {
            shortElements++;
        }
    }
    return shortElements; 
}
```

#### 3.2 Формирование нового массива из элементов заданного.

Пропишем метод, возвращающий новый массив из элементов заданного массива, отвечающих условию по их предельной длине.
Параметрами метода будут: заданный массив; его длина; количество элементов искомого массива (которое было найдено с помощью метода, указанного в п. 3.1); предельная длина элемента искомого массива.

Код метода:

```
string [] CreateArrayOfShortElements (string[] originalarray, int originalarraylen, int numberofshort, int sizeofshort)
{
    int j = 0;
    string[] shortArray = new string[numberofshort];

    for (int i = 0; i < originalarraylen; i++)
    {
        if (originalarray[i].Length <= sizeofshort)
        {
            shortArray[j] = originalarray[i];
            j++;
        }
    }
    return shortArray;
}
```

#### 3.3 Печать искомого массива.

Простой метод, предназначенный для вывода массива (в данном случае - для вывода искомого массива).

Код метода:

```
void PrintArray(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");
    }
    Console.WriteLine();
}
```

### 4. Написание основной части программы.

В основной части программы прописывается использование методов и переменных, о которых шла речь в предыдущих пункта.

Код:

```
int y = 3;
int len = newArray.Length;
int x = NumberOfShort(newArray, len, y);

string[] newArrayShort = CreateArrayOfShortElements(newArray, len, x, y);

Console.WriteLine("Массив из элементов заданного массива, длина которых не превышает 3:");
PrintArray(newArrayShort);
```

## Заключение

Тестируем программу, готовим блок-схему, делаем необходимые коммиты и направляем в удаленный репозиторий.